## Summary of the data we need, and where to find it:

• All of the information about the location of a water source is in the location table, specifically the town and province of that water source.

• water_source has the type of source and the number of people served by each source.
    
• visits has queue information, and connects source_id to location_id. There were multiple visits to sites, so we need to be careful to
include duplicate data (visit_count > 1 ).

• well_pollution has information about the quality of water from only wells, so we need to keep that in mind when we join this table.

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:02510251@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

### Step 1: Join location to visits

In [5]:
%%sql
SELECT
    v.source_id,
    v.location_id,
    l.town_name,
    l.province_name,
    v.visit_count,
    v.time_in_queue
FROM visits v
INNER JOIN location l ON v.location_id = l.location_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+--------------+-------------+-----------+---------------+-------------+---------------+
|  source_id   | location_id | town_name | province_name | visit_count | time_in_queue |
+--------------+-------------+-----------+---------------+-------------+---------------+
| AkHa00000224 |  AkHa00000  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00001224 |  AkHa00001  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00002224 |  AkHa00002  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00003224 |  AkHa00003  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00004224 |  AkHa00004  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00005224 |  AkHa00005  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00006224 |  AkHa00006  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00007224 |  AkHa00007  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00008224 |  AkHa00008  |   Harare  |     Akatsi    |      1      |       0       |
| AkHa00009224 |  AkHa00009  |   Harare  |     Akatsi    |      1      |       0       |
+--------------+-------------+-----------+---------------+-------------+---------------+
Truncated to displaylimit of 10.

### Step 2: Add water_source to the join

In [7]:
%%sql
SELECT
    v.source_id,
    v.location_id,
    l.town_name,
    l.province_name,
    ws.type_of_water_source,
    ws.number_of_people_served,
    v.visit_count,
    v.time_in_queue
FROM visits v
INNER JOIN location l ON v.location_id = l.location_id
INNER JOIN water_source ws ON v.source_id = ws.source_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+
|  source_id   | location_id | town_name | province_name | type_of_water_source | number_of_people_served | visit_count | time_in_queue |
+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+
| AkHa00000224 |  AkHa00000  |   Harare  |     Akatsi    |     tap_in_home      |           956           |      1      |       0       |
| AkHa00001224 |  AkHa00001  |   Harare  |     Akatsi    |  tap_in_home_broken  |           930           |      1      |       0       |
| AkHa00002224 |  AkHa00002  |   Harare  |     Akatsi    |  tap_in_home_broken  |           486           |      1      |       0       |
| AkHa00003224 |  AkHa00003  |   Harare  |     Akatsi    |         well         |           364           |      1      |       0       |
| AkHa00004224 |  AkHa00004  |   Harare  |     Akatsi    |  tap_in_home_broken  |           942           |      1      |       0       |
| AkHa00005224 |  AkHa00005  |   Harare  |     Akatsi    |     tap_in_home      |           736           |      1      |       0       |
| AkHa00006224 |  AkHa00006  |   Harare  |     Akatsi    |     tap_in_home      |           882           |      1      |       0       |
| AkHa00007224 |  AkHa00007  |   Harare  |     Akatsi    |     tap_in_home      |           554           |      1      |       0       |
| AkHa00008224 |  AkHa00008  |   Harare  |     Akatsi    |         well         |           398           |      1      |       0       |
| AkHa00009224 |  AkHa00009  |   Harare  |     Akatsi    |         well         |           346           |      1      |       0       |
+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+
Truncated to displaylimit of 10.

## Step 3: Add well_pollution (only for wells)

In [8]:
%%sql
SELECT
    v.source_id,
    v.location_id,
    l.town_name,
    l.province_name,
    ws.type_of_water_source,
    ws.number_of_people_served,
    v.visit_count,
    v.time_in_queue,
    wp.results AS pollution_status
FROM visits v
INNER JOIN location l ON v.location_id = l.location_id
INNER JOIN water_source ws ON v.source_id = ws.source_id
LEFT JOIN well_pollution wp ON ws.source_id = wp.source_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+--------------------------+
|  source_id   | location_id | town_name | province_name | type_of_water_source | number_of_people_served | visit_count | time_in_queue |     pollution_status     |
+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+--------------------------+
| AkHa00000224 |  AkHa00000  |   Harare  |     Akatsi    |     tap_in_home      |           956           |      1      |       0       |           None           |
| AkHa00001224 |  AkHa00001  |   Harare  |     Akatsi    |  tap_in_home_broken  |           930           |      1      |       0       |           None           |
| AkHa00002224 |  AkHa00002  |   Harare  |     Akatsi    |  tap_in_home_broken  |           486           |      1      |       0       |           None           |
| AkHa00003224 |  AkHa00003  |   Harare  |     Akatsi    |         well         |           364           |      1      |       0       |          Clean           |
| AkHa00004224 |  AkHa00004  |   Harare  |     Akatsi    |  tap_in_home_broken  |           942           |      1      |       0       |           None           |
| AkHa00005224 |  AkHa00005  |   Harare  |     Akatsi    |     tap_in_home      |           736           |      1      |       0       |           None           |
| AkHa00006224 |  AkHa00006  |   Harare  |     Akatsi    |     tap_in_home      |           882           |      1      |       0       |           None           |
| AkHa00007224 |  AkHa00007  |   Harare  |     Akatsi    |     tap_in_home      |           554           |      1      |       0       |           None           |
| AkHa00008224 |  AkHa00008  |   Harare  |     Akatsi    |         well         |           398           |      1      |       0       |          Clean           |
| AkHa00009224 |  AkHa00009  |   Harare  |     Akatsi    |         well         |           346           |      1      |       0       | Contaminated: Biological |
+--------------+-------------+-----------+---------------+----------------------+-------------------------+-------------+---------------+--------------------------+
Truncated to displaylimit of 10.

## Final view definition

In [17]:
%%sql
CREATE VIEW combined_analysis_table AS
-- This view assembles data from different tables into one to simplify analysis
SELECT
    ws.type_of_water_source AS source_type,
    l.town_name,
    l.province_name,
    l.location_type,
    ws.number_of_people_served AS people_served,
    v.time_in_queue,
    wp.results AS pollution_status
FROM visits v
LEFT JOIN well_pollution wp
       ON wp.source_id = v.source_id
INNER JOIN location l
       ON l.location_id = v.location_id
INNER JOIN water_source ws
       ON ws.source_id = v.source_id
WHERE v.visit_count = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

## Distribution of sources by province

In [18]:
%%sql
SELECT province_name, source_type, COUNT(*) AS source_count
FROM combined_analysis_table
GROUP BY province_name, source_type;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+---------------+--------------------+--------------+
| province_name |    source_type     | source_count |
+---------------+--------------------+--------------+
|     Sokoto    |       river        |     1709     |
|    Kilimani   |        well        |     4774     |
|    Hawassa    |     shared_tap     |     791      |
|     Akatsi    |        well        |     4921     |
|     Akatsi    |     shared_tap     |     1417     |
|    Kilimani   |       river        |     791      |
|     Akatsi    | tap_in_home_broken |     910      |
|    Kilimani   |    tap_in_home     |     1296     |
|    Hawassa    |        well        |     3276     |
|     Amanzi    |    tap_in_home     |     2334     |
+---------------+--------------------+--------------+
Truncated to displaylimit of 10.

## Where broken taps are most common

In [19]:
%%sql
SELECT town_name, COUNT(*) AS broken_taps
FROM combined_analysis_table
WHERE source_type = 'tap_in_home_broken'
GROUP BY town_name
ORDER BY broken_taps DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+-------------+
| town_name | broken_taps |
+-----------+-------------+
|   Rural   |     2885    |
|   Amina   |     461     |
|   Harare  |     303     |
|   Asmara  |     262     |
|   Lusaka  |     249     |
|  Kintampo |     166     |
|   Pwani   |     164     |
|   Mrembo  |     149     |
|    Zuri   |     146     |
|   Bello   |     136     |
+-----------+-------------+
Truncated to displaylimit of 10.

## Average queue times by source type

In [20]:
%%sql
SELECT source_type, AVG(time_in_queue) AS avg_queue_time
FROM combined_analysis_table
GROUP BY source_type;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+--------------------+----------------+
|    source_type     | avg_queue_time |
+--------------------+----------------+
|       river        |    17.0047     |
|        well        |     0.0000     |
|     shared_tap     |    95.5772     |
| tap_in_home_broken |     0.0000     |
|    tap_in_home     |     0.0000     |
+--------------------+----------------+

## Contamination breakdown for wells

In [22]:
%%sql
SELECT province_name, pollution_status, COUNT(*) AS well_count
FROM combined_analysis_table
WHERE source_type = 'well'
GROUP BY province_name, pollution_status;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

15 rows affected.

+---------------+--------------------------+------------+
| province_name |     pollution_status     | well_count |
+---------------+--------------------------+------------+
|     Akatsi    |          Clean           |    2194    |
|     Akatsi    | Contaminated: Biological |    671     |
|     Akatsi    |  Contaminated: Chemical  |    2056    |
|     Amanzi    |  Contaminated: Chemical  |    523     |
|     Amanzi    |          Clean           |    501     |
|     Amanzi    | Contaminated: Biological |    292     |
|    Hawassa    |  Contaminated: Chemical  |    1334    |
|    Hawassa    | Contaminated: Biological |    1434    |
|    Hawassa    |          Clean           |    508     |
|    Kilimani   |  Contaminated: Chemical  |    1879    |
+---------------+--------------------------+------------+
Truncated to displaylimit of 10.

## National split: rural vs urban population

In [24]:
%%sql
SELECT
    location_type,
    SUM(people_served) AS total_people
FROM combined_analysis_table
GROUP BY location_type
ORDER BY total_people DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+--------------+
| location_type | total_people |
+---------------+--------------+
|     Rural     |   17640298   |
|     Urban     |   9987842    |
+---------------+--------------+

## Population by water source type

In [25]:
%%sql
SELECT
    source_type,
    SUM(people_served) AS total_people
FROM combined_analysis_table
GROUP BY source_type
ORDER BY total_people DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+--------------------+--------------+
|    source_type     | total_people |
+--------------------+--------------+
|     shared_tap     |   11945272   |
|        well        |   4841724    |
|    tap_in_home     |   4678880    |
| tap_in_home_broken |   3799720    |
|       river        |   2362544    |
+--------------------+--------------+

## Abundance of sources by province

In [26]:
%%sql
SELECT
    province_name,
    source_type,
    COUNT(*) AS source_count
FROM combined_analysis_table
GROUP BY province_name, source_type
ORDER BY province_name, source_count DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+---------------+--------------------+--------------+
| province_name |    source_type     | source_count |
+---------------+--------------------+--------------+
|     Akatsi    |        well        |     4921     |
|     Akatsi    |     shared_tap     |     1417     |
|     Akatsi    |    tap_in_home     |     1281     |
|     Akatsi    | tap_in_home_broken |     910      |
|     Akatsi    |       river        |     411      |
|     Amanzi    |    tap_in_home     |     2334     |
|     Amanzi    | tap_in_home_broken |     2048     |
|     Amanzi    |        well        |     1316     |
|     Amanzi    |     shared_tap     |     994      |
|     Amanzi    |       river        |     258      |
+---------------+--------------------+--------------+
Truncated to displaylimit of 10.

## Abundance of sources by town

In [27]:
%%sql
SELECT
    town_name,
    source_type,
    COUNT(*) AS source_count
FROM combined_analysis_table
GROUP BY town_name, source_type
ORDER BY source_count DESC, town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

124 rows affected.

+-----------+--------------------+--------------+
| town_name |    source_type     | source_count |
+-----------+--------------------+--------------+
|   Rural   |        well        |    10916     |
|   Rural   |     shared_tap     |     4330     |
|   Rural   |    tap_in_home     |     3223     |
|   Rural   | tap_in_home_broken |     2885     |
|   Rural   |       river        |     2386     |
|   Harare  |        well        |     852      |
|   Dahabu  |    tap_in_home     |     641      |
|   Mrembo  |        well        |     557      |
|   Lusaka  |        well        |     522      |
|   Amina   | tap_in_home_broken |     461      |
+-----------+--------------------+--------------+
Truncated to displaylimit of 10.

## Broken in-home taps per town

In [28]:
%%sql
SELECT
    town_name,
    COUNT(*) AS broken_tap_sources
FROM combined_analysis_table
WHERE source_type = 'tap_in_home_broken'
GROUP BY town_name
ORDER BY broken_tap_sources DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+--------------------+
| town_name | broken_tap_sources |
+-----------+--------------------+
|   Rural   |        2885        |
|   Amina   |        461         |
|   Harare  |        303         |
|   Asmara  |        262         |
|   Lusaka  |        249         |
|  Kintampo |        166         |
|   Pwani   |        164         |
|   Mrembo  |        149         |
|    Zuri   |        146         |
|   Bello   |        136         |
+-----------+--------------------+
Truncated to displaylimit of 10.

## Queue time analysis by source type

In [29]:
%%sql
SELECT
    source_type,
    COUNT(*) AS sources,
    AVG(time_in_queue) AS avg_queue_minutes,
    MAX(time_in_queue) AS max_queue_minutes
FROM combined_analysis_table
GROUP BY source_type
ORDER BY avg_queue_minutes DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+--------------------+---------+-------------------+-------------------+
|    source_type     | sources | avg_queue_minutes | max_queue_minutes |
+--------------------+---------+-------------------+-------------------+
|     shared_tap     |   5767  |      95.5772      |        240        |
|       river        |   3379  |      17.0047      |         29        |
|        well        |  17383  |       0.0000      |         0         |
| tap_in_home_broken |   5856  |       0.0000      |         0         |
|    tap_in_home     |   7265  |       0.0000      |         0         |
+--------------------+---------+-------------------+-------------------+

## Wells contamination breakdown by province

In [30]:
%%sql
SELECT
    province_name,
    COALESCE(pollution_status, 'No data') AS pollution_status,
    COUNT(*) AS wells
FROM combined_analysis_table
WHERE source_type = 'well'
GROUP BY province_name, COALESCE(pollution_status, 'No data')
ORDER BY province_name, wells DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

15 rows affected.

+---------------+--------------------------+-------+
| province_name |     pollution_status     | wells |
+---------------+--------------------------+-------+
|     Akatsi    |          Clean           |  2194 |
|     Akatsi    |  Contaminated: Chemical  |  2056 |
|     Akatsi    | Contaminated: Biological |  671  |
|     Amanzi    |  Contaminated: Chemical  |  523  |
|     Amanzi    |          Clean           |  501  |
|     Amanzi    | Contaminated: Biological |  292  |
|    Hawassa    | Contaminated: Biological |  1434 |
|    Hawassa    |  Contaminated: Chemical  |  1334 |
|    Hawassa    |          Clean           |  508  |
|    Kilimani   |  Contaminated: Chemical  |  1879 |
+---------------+--------------------------+-------+
Truncated to displaylimit of 10.

## Shared taps needing extra taps (≥ 30 min)

In [31]:
%%sql
SELECT
    province_name,
    town_name,
    SUM(people_served) AS total_people_served,
    AVG(time_in_queue) AS avg_queue_minutes,
    SUM(CASE WHEN time_in_queue >= 30
             THEN FLOOR(time_in_queue / 30)
             ELSE 0 END) AS taps_to_install
FROM combined_analysis_table
WHERE source_type = 'shared_tap'
GROUP BY province_name, town_name
HAVING taps_to_install > 0
ORDER BY taps_to_install DESC, avg_queue_minutes DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+---------------------+-------------------+-----------------+
| province_name | town_name | total_people_served | avg_queue_minutes | taps_to_install |
+---------------+-----------+---------------------+-------------------+-----------------+
|     Akatsi    |   Rural   |       2693368       |      92.0616      |       3426      |
|    Kilimani   |   Rural   |       2215106       |      95.8271      |       2921      |
|     Sokoto    |   Rural   |       1965586       |      92.0042      |       2502      |
|    Hawassa    |   Rural   |       1497734       |      95.4727      |       1940      |
|    Kilimani   |    Zuri   |        611534       |      127.9340     |       1113      |
|     Amanzi    |   Rural   |        583712       |      92.4388      |       732       |
|     Amanzi    |   Asmara  |        412226       |      85.8545      |       508       |
|     Amanzi    |   Dahabu  |        278654       |      90.3287      |       363       |
|     Amanzi    |   Bello   |        203148       |      125.0543     |       344       |
|     Amanzi    |   Pwani   |        263746       |      79.5285      |       267       |
+---------------+-----------+---------------------+-------------------+-----------------+
Truncated to displaylimit of 10.

## Rivers: drill wells nearby

In [32]:
%%sql
SELECT
    province_name,
    town_name,
    COUNT(*) AS river_sources,
    SUM(people_served) AS people_served_by_river
FROM combined_analysis_table
WHERE source_type = 'river'
GROUP BY province_name, town_name
ORDER BY people_served_by_river DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

30 rows affected.

+---------------+-----------+---------------+------------------------+
| province_name | town_name | river_sources | people_served_by_river |
+---------------+-----------+---------------+------------------------+
|     Sokoto    |   Rural   |      1240     |         867242         |
|    Kilimani   |   Rural   |      514      |         358914         |
|     Akatsi    |   Rural   |      371      |         264848         |
|    Hawassa    |   Rural   |      167      |         116678         |
|     Sokoto    |   Ilanga  |       99      |         67322          |
|     Amanzi    |   Rural   |       94      |         67182          |
|    Kilimani   |    Zuri   |       97      |         65636          |
|     Sokoto    |  Majengo  |       89      |         61728          |
|     Sokoto    |    Kofi   |       82      |         59448          |
|     Sokoto    |   Bahari  |       78      |         54106          |
+---------------+-----------+---------------+------------------------+
Truncated to displaylimit of 10.

## Summary table for stakeholder page

In [33]:
%%sql
SELECT
    'Urban/Rural split' AS metric,
    CONCAT(
        'Urban=', FORMAT(SUM(CASE WHEN location_type = 'Urban' THEN people_served ELSE 0 END), 0),
        '; Rural=', FORMAT(SUM(CASE WHEN location_type = 'Rural' THEN people_served ELSE 0 END), 0)
    ) AS value
FROM combined_analysis_table

UNION ALL

SELECT
    'Shared taps % of population',
    CONCAT(
        FORMAT(100.0 * SUM(CASE WHEN source_type = 'shared_tap' THEN people_served ELSE 0 END)
               / SUM(people_served), 2), '%'
    )
FROM combined_analysis_table

UNION ALL

SELECT
    'In-home infrastructure %',
    CONCAT(
        FORMAT(100.0 * SUM(CASE WHEN source_type = 'tap_in_home' THEN people_served ELSE 0 END)
               / SUM(people_served), 2), '%'
    )
FROM combined_analysis_table

UNION ALL

SELECT
    'Wells %',
    CONCAT(
        FORMAT(100.0 * SUM(CASE WHEN source_type = 'well' THEN people_served ELSE 0 END)
               / SUM(people_served), 2), '%'
    )
FROM combined_analysis_table;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+-----------------------------+-----------------------------------+
|            metric           |               value               |
+-----------------------------+-----------------------------------+
|      Urban/Rural split      | Urban=9,987,842; Rural=17,640,298 |
| Shared taps % of population |               43.24%              |
|   In-home infrastructure %  |               16.94%              |
|           Wells %           |               17.52%              |
+-----------------------------+-----------------------------------+

## Engineering-ready interventions (preview list)

In [34]:
%%sql
SELECT
    province_name,
    town_name,
    source_type,
    CASE
        WHEN source_type = 'river'
            THEN 'Drill well'
        WHEN source_type = 'well' AND pollution_status = 'Contaminated: Chemical'
            THEN 'Install RO filter'
        WHEN source_type = 'well' AND pollution_status = 'Contaminated: Biological'
            THEN 'Install UV and RO filter'
        WHEN source_type = 'shared_tap' AND time_in_queue >= 30
            THEN CONCAT('Install ', FLOOR(time_in_queue / 30), ' taps nearby')
        WHEN source_type = 'tap_in_home_broken'
            THEN 'Diagnose local infrastructure'
        ELSE NULL
    END AS action_required
FROM combined_analysis_table
WHERE
    (source_type = 'well' AND pollution_status IS NOT NULL AND pollution_status <> 'Clean')
    OR source_type = 'river'
    OR source_type = 'tap_in_home_broken'
    OR (source_type = 'shared_tap' AND time_in_queue >= 30)
ORDER BY province_name, town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25334 rows affected.

+---------------+-----------+--------------------+-------------------------------+
| province_name | town_name |    source_type     |        action_required        |
+---------------+-----------+--------------------+-------------------------------+
|     Akatsi    |   Harare  |        well        |       Install RO filter       |
|     Akatsi    |   Harare  | tap_in_home_broken | Diagnose local infrastructure |
|     Akatsi    |   Harare  |        well        |       Install RO filter       |
|     Akatsi    |   Harare  |        well        |       Install RO filter       |
|     Akatsi    |   Harare  |        well        |    Install UV and RO filter   |
|     Akatsi    |   Harare  | tap_in_home_broken | Diagnose local infrastructure |
|     Akatsi    |   Harare  |        well        |    Install UV and RO filter   |
|     Akatsi    |   Harare  | tap_in_home_broken | Diagnose local infrastructure |
|     Akatsi    |   Harare  |        well        |    Install UV and RO filter   |
|     Akatsi    |   Harare  |        well        |    Install UV and RO filter   |
+---------------+-----------+--------------------+-------------------------------+
Truncated to displaylimit of 10.

## Sanity checks and validation

#### Total people served:

In [35]:
%%sql
SELECT SUM(people_served) AS total_people
FROM combined_analysis_table;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+--------------+
| total_people |
+--------------+
|   27628140   |
+--------------+

#### Duplicate guard check:

In [38]:
%%sql
SELECT 
    source_type, 
    town_name, 
    province_name, 
    COUNT(*) AS row_count
FROM combined_analysis_table
GROUP BY source_type, town_name, province_name
ORDER BY row_count DESC
LIMIT 20;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

20 rows affected.

+--------------------+-----------+---------------+-----------+
|    source_type     | town_name | province_name | row_count |
+--------------------+-----------+---------------+-----------+
|        well        |   Rural   |     Akatsi    |    3620   |
|        well        |   Rural   |    Kilimani   |    2789   |
|        well        |   Rural   |    Hawassa    |    1929   |
|        well        |   Rural   |     Sokoto    |    1796   |
|     shared_tap     |   Rural   |     Akatsi    |    1315   |
|       river        |   Rural   |     Sokoto    |    1240   |
|     shared_tap     |   Rural   |    Kilimani   |    1064   |
| tap_in_home_broken |   Rural   |     Amanzi    |    973    |
|    tap_in_home     |   Rural   |     Amanzi    |    973    |
|     shared_tap     |   Rural   |     Sokoto    |    960    |
+--------------------+-----------+---------------+-----------+
Truncated to displaylimit of 10.

#### Missing pollution data:

In [39]:
%%sql
SELECT COUNT(*) AS wells_without_tests
FROM combined_analysis_table
WHERE source_type = 'well' AND pollution_status IS NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+
| wells_without_tests |
+---------------------+
|          0          |
+---------------------+

## Provincial pivot analysis step by step

#### Prepare: quick preview

In [40]:
%%sql
SELECT source_type, town_name, province_name, people_served
FROM combined_analysis_table
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+--------------------+-----------+---------------+---------------+
|    source_type     | town_name | province_name | people_served |
+--------------------+-----------+---------------+---------------+
|       river        |   Ilanga  |     Sokoto    |      402      |
|        well        |   Rural   |    Kilimani   |      252      |
|     shared_tap     |   Rural   |    Hawassa    |      542      |
|        well        |   Lusaka  |     Akatsi    |      210      |
|     shared_tap     |   Rural   |     Akatsi    |      2598     |
|       river        |   Rural   |    Kilimani   |      862      |
| tap_in_home_broken |   Rural   |     Akatsi    |      496      |
|    tap_in_home     |   Rural   |    Kilimani   |      562      |
|        well        |  Zanzibar |    Hawassa    |      308      |
|    tap_in_home     |   Dahabu  |     Amanzi    |      556      |
+--------------------+-----------+---------------+---------------+
Truncated to displaylimit of 10.

### Step 1: Compute province totals (CTE)

In [41]:
%%sql
WITH province_totals AS (
    SELECT
        province_name,
        SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name
)
SELECT *
FROM province_totals
ORDER BY total_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+---------------------+
| province_name | total_people_served |
+---------------+---------------------+
|    Kilimani   |       6584764       |
|     Akatsi    |       5993306       |
|     Sokoto    |       5774434       |
|     Amanzi    |       5431826       |
|    Hawassa    |       3843810       |
+---------------+---------------------+

## Step 2: Provincial percentages by source type

In [42]:
%%sql
WITH province_totals AS (
    SELECT
        province_name,
        SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name
)
SELECT
    ct.province_name,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'river'
                         THEN ct.people_served ELSE 0 END)
        / pt.total_people_served, 0
    ) AS pct_river,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'shared_tap'
                         THEN ct.people_served ELSE 0 END)
        / pt.total_people_served, 0
    ) AS pct_shared_tap,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home'
                         THEN ct.people_served ELSE 0 END)
        / pt.total_people_served, 0
    ) AS pct_tap_in_home,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken'
                         THEN ct.people_served ELSE 0 END)
        / pt.total_people_served, 0
    ) AS pct_tap_in_home_broken,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'well'
                         THEN ct.people_served ELSE 0 END)
        / pt.total_people_served, 0
    ) AS pct_well
FROM combined_analysis_table ct
JOIN province_totals pt
  ON ct.province_name = pt.province_name
GROUP BY ct.province_name
ORDER BY ct.province_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+----------------+-----------------+------------------------+----------+
| province_name | pct_river | pct_shared_tap | pct_tap_in_home | pct_tap_in_home_broken | pct_well |
+---------------+-----------+----------------+-----------------+------------------------+----------+
|     Akatsi    |     5     |       49       |        14       |           10           |    23    |
|     Amanzi    |     3     |       38       |        28       |           24           |    7     |
|    Hawassa    |     4     |       43       |        15       |           15           |    24    |
|    Kilimani   |     8     |       47       |        13       |           12           |    20    |
|     Sokoto    |     21    |       38       |        16       |           10           |    15    |
+---------------+-----------+----------------+-----------------+------------------------+----------+

### Step 3: Spot patterns (targeting decisions)

In [43]:
%%sql
WITH province_totals AS (
    SELECT province_name, SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name
),
prov_pct AS (
    SELECT
        ct.province_name,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'river' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_river,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_broken_in_home,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_in_home
    FROM combined_analysis_table ct
    JOIN province_totals pt ON ct.province_name = pt.province_name
    GROUP BY ct.province_name
)
SELECT *
FROM prov_pct
ORDER BY pct_river DESC, pct_broken_in_home DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+--------------------+-------------+
| province_name | pct_river | pct_broken_in_home | pct_in_home |
+---------------+-----------+--------------------+-------------+
|     Sokoto    |     21    |         10         |      16     |
|    Kilimani   |     8     |         12         |      13     |
|     Akatsi    |     5     |         10         |      14     |
|    Hawassa    |     4     |         15         |      15     |
|     Amanzi    |     3     |         24         |      28     |
+---------------+-----------+--------------------+-------------+

### Step 4: Town-level percentages (fine targeting)

In [44]:
%%sql
WITH town_totals AS (
    SELECT
        province_name,
        town_name,
        SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name, town_name
)
SELECT
    ct.province_name,
    ct.town_name,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'river'
                         THEN ct.people_served ELSE 0 END)
        / tt.total_people_served, 0
    ) AS pct_river,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'shared_tap'
                         THEN ct.people_served ELSE 0 END)
        / tt.total_people_served, 0
    ) AS pct_shared_tap,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home'
                         THEN ct.people_served ELSE 0 END)
        / tt.total_people_served, 0
    ) AS pct_tap_in_home,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken'
                         THEN ct.people_served ELSE 0 END)
        / tt.total_people_served, 0
    ) AS pct_tap_in_home_broken,

    ROUND(
        100.0 * SUM(CASE WHEN ct.source_type = 'well'
                         THEN ct.people_served ELSE 0 END)
        / tt.total_people_served, 0
    ) AS pct_well
FROM combined_analysis_table ct
JOIN town_totals tt
  ON ct.province_name = tt.province_name
 AND ct.town_name     = tt.town_name
GROUP BY ct.province_name, ct.town_name
ORDER BY ct.province_name, ct.town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
| province_name | town_name | pct_river | pct_shared_tap | pct_tap_in_home | pct_tap_in_home_broken | pct_well |
+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
|     Akatsi    |   Harare  |     2     |       17       |        28       |           27           |    27    |
|     Akatsi    |  Kintampo |     2     |       15       |        31       |           26           |    26    |
|     Akatsi    |   Lusaka  |     2     |       17       |        28       |           28           |    26    |
|     Akatsi    |   Rural   |     6     |       59       |        9        |           5            |    22    |
|     Amanzi    |  Abidjan  |     2     |       53       |        22       |           19           |    4     |
|     Amanzi    |   Amina   |     8     |       24       |        3        |           56           |    9     |
|     Amanzi    |   Asmara  |     3     |       49       |        24       |           20           |    4     |
|     Amanzi    |   Bello   |     3     |       53       |        20       |           22           |    3     |
|     Amanzi    |   Dahabu  |     3     |       37       |        55       |           1            |    4     |
|     Amanzi    |   Pwani   |     3     |       53       |        20       |           21           |    4     |
+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
Truncated to displaylimit of 10.

### Step 5: Shortlist actions per province (operational cut)

In [45]:
%%sql
WITH province_totals AS (
    SELECT province_name, SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name
),
prov_pct AS (
    SELECT
        ct.province_name,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'river' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_river,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'shared_tap' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_shared_tap,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_broken_in_home,
        ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'well' THEN ct.people_served ELSE 0 END)
              / pt.total_people_served, 0) AS pct_well
    FROM combined_analysis_table ct
    JOIN province_totals pt ON ct.province_name = pt.province_name
    GROUP BY ct.province_name
)
SELECT
    province_name,
    CASE
        WHEN pct_river >= 20 THEN 'Drill wells (high river reliance)'
        WHEN pct_broken_in_home >= 20 THEN 'Repair home infrastructure (pipes/pumps/reservoirs)'
        WHEN pct_shared_tap >= 30 THEN 'Install additional shared taps'
        WHEN pct_well >= 25 THEN 'Test wells and install RO/UV where needed'
        ELSE 'Mixed interventions'
    END AS suggested_priority,
    CONCAT(
        'river=', pct_river, '%, ',
        'broken_in_home=', pct_broken_in_home, '%, ',
        'shared_tap=', pct_shared_tap, '%, ',
        'well=', pct_well, '%'
    ) AS snapshot
FROM prov_pct
ORDER BY suggested_priority, province_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------------------------------------------------+---------------------------------------------------------+
| province_name |                  suggested_priority                 |                         snapshot                        |
+---------------+-----------------------------------------------------+---------------------------------------------------------+
|     Sokoto    |          Drill wells (high river reliance)          | river=21%, broken_in_home=10%, shared_tap=38%, well=15% |
|     Akatsi    |            Install additional shared taps           |  river=5%, broken_in_home=10%, shared_tap=49%, well=23% |
|    Hawassa    |            Install additional shared taps           |  river=4%, broken_in_home=15%, shared_tap=43%, well=24% |
|    Kilimani   |            Install additional shared taps           |  river=8%, broken_in_home=12%, shared_tap=47%, well=20% |
|     Amanzi    | Repair home infrastructure (pipes/pumps/reservoirs) |  river=3%, broken_in_home=24%, shared_tap=38%, well=7%  |
+---------------+-----------------------------------------------------+---------------------------------------------------------+

## Step 6: Guardrails and sanity checks

#### Percent sums per province:

In [47]:
%%sql
WITH province_totals AS (
    SELECT province_name, SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name
)
SELECT
    ct.province_name,
    ROUND(100.0 * SUM(ct.people_served) / pt.total_people_served, 0) AS pct_sum_check
FROM combined_analysis_table ct
JOIN province_totals pt ON ct.province_name = pt.province_name
GROUP BY ct.province_name
ORDER BY pct_sum_check DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+---------------+
| province_name | pct_sum_check |
+---------------+---------------+
|     Akatsi    |      100      |
|    Kilimani   |      100      |
|     Sokoto    |      100      |
|    Hawassa    |      100      |
|     Amanzi    |      100      |
+---------------+---------------+

#### Top towns with broken in-home taps:

In [48]:
%%sql
SELECT
    province_name,
    town_name,
    COUNT(*) AS broken_sources,
    SUM(people_served) AS affected_people
FROM combined_analysis_table
WHERE source_type = 'tap_in_home_broken'
GROUP BY province_name, town_name
ORDER BY affected_people DESC, broken_sources DESC
LIMIT 20;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

20 rows affected.

+---------------+-----------+----------------+-----------------+
| province_name | town_name | broken_sources | affected_people |
+---------------+-----------+----------------+-----------------+
|     Amanzi    |   Rural   |      973       |      634518     |
|    Kilimani   |   Rural   |      549       |      360784     |
|    Hawassa    |   Rural   |      547       |      354026     |
|     Sokoto    |   Rural   |      497       |      327036     |
|     Amanzi    |   Amina   |      392       |      254732     |
|     Akatsi    |   Rural   |      319       |      208322     |
|     Amanzi    |   Asmara  |      262       |      167600     |
|     Akatsi    |   Lusaka  |      249       |      159062     |
|     Akatsi    |   Harare  |      176       |      113146     |
|     Akatsi    |  Kintampo |      166       |      106746     |
+---------------+-----------+----------------+-----------------+
Truncated to displaylimit of 10.

## Town‑level aggregation

### Step 1: Preview the base data

In [49]:
%%sql
SELECT province_name, town_name, source_type, people_served
FROM combined_analysis_table
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+---------------+-----------+--------------------+---------------+
| province_name | town_name |    source_type     | people_served |
+---------------+-----------+--------------------+---------------+
|     Sokoto    |   Ilanga  |       river        |      402      |
|    Kilimani   |   Rural   |        well        |      252      |
|    Hawassa    |   Rural   |     shared_tap     |      542      |
|     Akatsi    |   Lusaka  |        well        |      210      |
|     Akatsi    |   Rural   |     shared_tap     |      2598     |
|    Kilimani   |   Rural   |       river        |      862      |
|     Akatsi    |   Rural   | tap_in_home_broken |      496      |
|    Kilimani   |   Rural   |    tap_in_home     |      562      |
|    Hawassa    |  Zanzibar |        well        |      308      |
|     Amanzi    |   Dahabu  |    tap_in_home     |      556      |
+---------------+-----------+--------------------+---------------+
Truncated to displaylimit of 10.

### Step 2: Build town totals (CTE)

In [51]:
%%sql
WITH town_totals AS (
    SELECT
        province_name,
        town_name,
        SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name, town_name
)
SELECT *
FROM town_totals
ORDER BY total_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+---------------------+
| province_name | town_name | total_people_served |
+---------------+-----------+---------------------+
|     Akatsi    |   Rural   |       4602096       |
|    Kilimani   |   Rural   |       4054284       |
|     Sokoto    |   Rural   |       3989718       |
|    Hawassa    |   Rural   |       2859154       |
|     Amanzi    |   Rural   |       2135046       |
|    Kilimani   |    Zuri   |        857186       |
|     Amanzi    |   Asmara  |        834026       |
|     Amanzi    |   Dahabu  |        747662       |
|     Akatsi    |   Lusaka  |        568068       |
|     Amanzi    |   Pwani   |        497522       |
+---------------+-----------+---------------------+
Truncated to displaylimit of 10.

### Step 3: Calculate percentages by source type

In [52]:
%%sql
WITH town_totals AS (
    SELECT
        province_name,
        town_name,
        SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name, town_name
)
SELECT
    ct.province_name,
    ct.town_name,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'river'
                           THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS pct_river,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'shared_tap'
                           THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS pct_shared_tap,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home'
                           THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS pct_tap_in_home,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken'
                           THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS pct_tap_in_home_broken,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'well'
                           THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS pct_well
FROM combined_analysis_table ct
JOIN town_totals tt
  ON ct.province_name = tt.province_name
 AND ct.town_name     = tt.town_name
GROUP BY ct.province_name, ct.town_name
ORDER BY ct.town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
| province_name | town_name | pct_river | pct_shared_tap | pct_tap_in_home | pct_tap_in_home_broken | pct_well |
+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
|     Amanzi    |  Abidjan  |     2     |       53       |        22       |           19           |    4     |
|    Kilimani   |   Amara   |     8     |       22       |        25       |           16           |    30    |
|     Amanzi    |   Amina   |     8     |       24       |        3        |           56           |    9     |
|    Hawassa    |   Amina   |     2     |       14       |        19       |           24           |    42    |
|     Amanzi    |   Asmara  |     3     |       49       |        24       |           20           |    4     |
|     Sokoto    |   Bahari  |     21    |       11       |        36       |           12           |    20    |
|     Amanzi    |   Bello   |     3     |       53       |        20       |           22           |    3     |
|     Sokoto    |   Cheche  |     19    |       16       |        35       |           12           |    18    |
|     Amanzi    |   Dahabu  |     3     |       37       |        55       |           1            |    4     |
|    Hawassa    |    Deka   |     3     |       16       |        23       |           21           |    38    |
+---------------+-----------+-----------+----------------+-----------------+------------------------+----------+
Truncated to displaylimit of 10.

### Step 4: Store results in a temporary table

In [53]:
%%sql
CREATE TEMPORARY TABLE town_aggregated_water_access AS
WITH town_totals AS (
    SELECT province_name, town_name, SUM(people_served) AS total_people_served
    FROM combined_analysis_table
    GROUP BY province_name, town_name
)
SELECT
    ct.province_name,
    ct.town_name,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'river' THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS river,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'shared_tap' THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS shared_tap,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home' THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS tap_in_home,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'tap_in_home_broken' THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS tap_in_home_broken,
    ROUND(100.0 * SUM(CASE WHEN ct.source_type = 'well' THEN ct.people_served ELSE 0 END) / tt.total_people_served, 0) AS well
FROM combined_analysis_table ct
JOIN town_totals tt
  ON ct.province_name = tt.province_name
 AND ct.town_name     = tt.town_name
GROUP BY ct.province_name, ct.town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

++
||
++
++

### Step 5: Explore patterns

#### a) Towns with highest river reliance

In [55]:
%%sql
SELECT province_name, town_name, river
FROM town_aggregated_water_access
ORDER BY river DESC
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+---------------+-----------+-------+
| province_name | town_name | river |
+---------------+-----------+-------+
|     Sokoto    |   Rural   |   22  |
|     Sokoto    |   Bahari  |   21  |
|     Sokoto    |    Kofi   |   20  |
|     Sokoto    |   Cheche  |   19  |
|     Sokoto    |  Majengo  |   18  |
|     Sokoto    |   Marang  |   17  |
|     Sokoto    |   Ilanga  |   16  |
|    Kilimani   |   Rural   |   9   |
|    Kilimani   |   Amara   |   8   |
|     Amanzi    |   Amina   |   8   |
+---------------+-----------+-------+
Truncated to displaylimit of 10.

#### b) Towns with broken in-home taps

In [56]:
%%sql
SELECT province_name, town_name, tap_in_home, tap_in_home_broken
FROM town_aggregated_water_access
ORDER BY tap_in_home_broken DESC
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+---------------+-----------+-------------+--------------------+
| province_name | town_name | tap_in_home | tap_in_home_broken |
+---------------+-----------+-------------+--------------------+
|     Amanzi    |   Amina   |      3      |         56         |
|     Amanzi    |   Rural   |      30     |         30         |
|     Akatsi    |   Lusaka  |      28     |         28         |
|     Akatsi    |   Harare  |      28     |         27         |
|     Akatsi    |  Kintampo |      31     |         26         |
|    Hawassa    |   Amina   |      19     |         24         |
|    Hawassa    |  Yaounde  |      22     |         23         |
|    Hawassa    |   Djenne  |      19     |         23         |
|    Hawassa    |   Serowe  |      23     |         23         |
|     Amanzi    |   Bello   |      20     |         22         |
+---------------+-----------+-------------+--------------------+
Truncated to displaylimit of 10.

#### c) Ratio of broken taps to installed taps

In [57]:
%%sql
SELECT
    province_name,
    town_name,
    ROUND(tap_in_home_broken / (tap_in_home_broken + tap_in_home) * 100, 0) AS pct_broken_taps
FROM town_aggregated_water_access
ORDER BY pct_broken_taps DESC
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+---------------+-----------+-----------------+
| province_name | town_name | pct_broken_taps |
+---------------+-----------+-----------------+
|     Amanzi    |   Amina   |        95       |
|    Kilimani   |    Zuri   |        65       |
|    Hawassa    |   Amina   |        56       |
|    Hawassa    |   Djenne  |        55       |
|    Kilimani   |   Rural   |        53       |
|     Amanzi    |   Bello   |        52       |
|    Hawassa    |  Yaounde  |        51       |
|     Amanzi    |   Pwani   |        51       |
|    Hawassa    |   Rural   |        50       |
|     Amanzi    |   Rural   |        50       |
+---------------+-----------+-----------------+
Truncated to displaylimit of 10.

#### Step 6: Sanity check totals

In [58]:
%%sql
SELECT SUM(river + shared_tap + tap_in_home + tap_in_home_broken + well) AS pct_sum_check
FROM town_aggregated_water_access;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------+
| pct_sum_check |
+---------------+
|      3106     |
+---------------+